dani71153/ROS_Arduino_ESP32_Workspace/PlatformIO/Projects/PIDDevelopment/OtherCodes/MotorControlPIDV1_Bakcup.cpp
#include <Arduino.h>
#include <ESP32Encoder.h>

class Motor {
  private:
    int pinEnable;
    int pinIN1;
    int pinIN2;
    int pinEncoderA;
    int pinEncoderB;
    float kp, ki, kd;
    float referenciaVelocidad;
    float errorActual, errorPrevio, sumaErrores, derivadaError;
    unsigned long tiempoPrevio;
    unsigned long intervaloMuestreo;
    ESP32Encoder encoder;
    long posicionEncoder;
    float velocidadActual;
    const float pulsosPorRevolucion = 4320.0; // Pulsos del encoder por revolución

  public:
    Motor(int enable, int in1, int in2, int encoderA, int encoderB, float kp, float ki, float kd, unsigned long muestreo) 
      : pinEnable(enable), pinIN1(in1), pinIN2(in2), pinEncoderA(encoderA), pinEncoderB(encoderB), kp(kp), ki(ki), kd(kd), 
        intervaloMuestreo(muestreo), errorActual(0), errorPrevio(0), sumaErrores(0), derivadaError(0), referenciaVelocidad(0), 
        tiempoPrevio(0), posicionEncoder(0), velocidadActual(0) {
    }

    void inicializar() {
      // Configuración de los pines de motor
      pinMode(pinEnable, OUTPUT);
      pinMode(pinIN1, OUTPUT);
      pinMode(pinIN2, OUTPUT);

      // Configuración del encoder
      encoder.attachHalfQuad(pinEncoderA, pinEncoderB);
      encoder.clearCount();

      // Inicializar tiempo
      tiempoPrevio = millis();
    }

    // Configuración de velocidad por ticks por segundo
    void setReferenciaVelocidad(float referencia) {
      referenciaVelocidad = referencia;
    }

    // Configuración de velocidad por RPS (Revoluciones por segundo)
    void setReferenciaVelocidadRPS(float rps) {
      referenciaVelocidad = rps * pulsosPorRevolucion; // Convertir RPS a ticks por segundo
    }

    // Configuración de velocidad por RPM (Revoluciones por minuto)
    void setReferenciaVelocidadRPM(float rpm) {
      float rps = rpm / 60.0;  // Convertir RPM a RPS
      referenciaVelocidad = rps * pulsosPorRevolucion; // Convertir RPS a ticks por segundo
    }

    void actualizar() {
      // Controlar la velocidad de muestreo
      unsigned long tiempoActual = millis();
      if (tiempoActual - tiempoPrevio >= intervaloMuestreo) {
        long posicionAnterior = posicionEncoder;
        posicionEncoder = leerEncoder();

        velocidadActual = calcularVelocidad(posicionEncoder, posicionAnterior, tiempoPrevio);
        tiempoPrevio = tiempoActual;

        float salidaPID = calcularPID(referenciaVelocidad, velocidadActual);
        controlarMotor(salidaPID);
      }
    }

    long leerEncoder() {
      return encoder.getCount();
    }

    float calcularVelocidad(long posicionActual, long posicionAnterior, unsigned long tiempoAnterior) {
      long deltaPosicion = posicionActual - posicionAnterior;
      unsigned long deltaTiempo = millis() - tiempoAnterior;
      float velocidad = (deltaPosicion / (float)deltaTiempo) * 1000;
      return velocidad;
    }

    float calcularPID(float referencia, float actual) {
      errorActual = referencia - actual;
      sumaErrores += errorActual;
      derivadaError = errorActual - errorPrevio;

      float salida = (kp * errorActual) + (ki * sumaErrores) + (kd * derivadaError);
      errorPrevio = errorActual;

      if (salida > 255) salida = 255;
      if (salida < -255) salida = -255;

      return salida;
    }

    void controlarMotor(float valorPID) {
      if (valorPID > 0) {
        digitalWrite(pinIN1, HIGH);
        digitalWrite(pinIN2, LOW);
        analogWrite(pinEnable, abs(valorPID));
      } else if (valorPID < 0) {
        digitalWrite(pinIN1, LOW);
        digitalWrite(pinIN2, HIGH);
        analogWrite(pinEnable, abs(valorPID));
      } else {
        analogWrite(pinEnable, 0);
      }
    }

    // Obtener la velocidad en ticks por segundo
    float getVelocidadTicksPorSegundo() {
      return velocidadActual;
    }

    // Obtener la velocidad en RPS (Revoluciones por segundo)
    float getVelocidadRPS() {
      return (velocidadActual / pulsosPorRevolucion);
    }

    // Obtener la velocidad en RPM (Revoluciones por minuto)
    float getVelocidadRPM() {
      return ((velocidadActual / pulsosPorRevolucion) * 60.0);
    }
};
